backend/SISNET/extracted/ejemplos/ejemplos/ejemplo eFactura Exportacion.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webServices.sitioWeb.crp.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:recepcionCFECertiTest>
         <noResetFecha>true</noResetFecha>
         <!--Optional:-->
         <cantIteraciones>5</cantIteraciones>
         <tipoCFE>121</tipoCFE>
         <!--Optional:-->
         <claveUnicaCaja>1/TEST</claveUnicaCaja>
         <wsVarios>
            <clauVenta>FOB</clauVenta>
            <fchEmis>21/12/2016</fchEmis>
            <fmaPago>1</fmaPago>
            <mntBruto>0.0</mntBruto>
            <modVenta>1</modVenta>
            <viaTransp>1</viaTransp>
         </wsVarios>
         <wsReceptor>
            <ciudadRecep>San Pablo</ciudadRecep>
            <codPaisRecep>BR</codPaisRecep>
            <deptoRecep>MontevideoDepto</deptoRecep>
            <dirRecep>Avda. Río de Janeiro 999</dirRecep>
            <docRecep>FE1234567890</docRecep>
            <rznSocRecep>BRASIL S.A.</rznSocRecep>
            <tipoDocRecep>4</tipoDocRecep>
         </wsReceptor>
         <wsTotales>
            <cantLinDet>3</cantLinDet>
            <mntExpoyAsim>400000.0</mntExpoyAsim>
            <mntIVATasaBas>0.0</mntIVATasaBas>
            <mntIVATasaMin>0.0</mntIVATasaMin>
            <mntNetoIvaTasaBasica>0.0</mntNetoIvaTasaBasica>
            <mntNetoIvaTasaMin>0.0</mntNetoIvaTasaMin>
            <mntNoGrv>0.0</mntNoGrv>
            <mntPagar>400000.0</mntPagar>
            <mntTotCredFisc>0.0</mntTotCredFisc>
            <mntTotRetenido>0.0</mntTotRetenido>
            <mntTotal>400000.0</mntTotal>
            <montoNF>0.0</montoNF>
            <tpoCambio>22.0</tpoCambio>
            <tpoMoneda>USD</tpoMoneda>
         </wsTotales>
         <listaWsItems>
            <cantidad>2500.0</cantidad>
            <indFact>10</indFact>
            <montoItem>250000.0</montoItem>
            <nomItem>abc</nomItem>
            <nroLinDet>1</nroLinDet>
            <precioUnitario>100.0</precioUnitario>
            <uniMed>kg</uniMed>
         </listaWsItems>
         <listaWsItems>
            <cantidad>50.0</cantidad>
            <indFact>10</indFact>
            <montoItem>100000.0</montoItem>
            <nomItem>bcd</nomItem>
            <nroLinDet>2</nroLinDet>
            <precioUnitario>2000.0</precioUnitario>
            <uniMed>kg</uniMed>
         </listaWsItems>
         <listaWsItems>
            <cantidad>1000.0</cantidad>
            <indFact>10</indFact>
            <montoItem>50000.0</montoItem>
            <nomItem>cde</nomItem>
            <nroLinDet>3</nroLinDet>
            <precioUnitario>50.0</precioUnitario>
            <uniMed>kg</uniMed>
         </listaWsItems>
         <impresionImprimirSiNo>n</impresionImprimirSiNo>
         <impresionImpresora>BROTHER</impresionImpresora>
         <impresionFormato>FacNorImpGeneralV16Cab</impresionFormato>
         <impresionNumeroVias>2</impresionNumeroVias>
         <simular>2</simular>
         <emailCuerpo/>
      </web:recepcionCFECertiTest>
   </soapenv:Body>
</soapenv:Envelope>